
#+BIBLIOGRAPHY: literature.bib apalike
#+BEGIN_SRC emacs-lisp :exports none :results silent :tangle no
  (setq org-babel-inline-result-wrap "\\(%s\\)")
(setq bibtex-completion-bibliography
      '("literature.bib"))
#+END_SRC


#+BEGIN_COMMENT

#+END_COMMENT

* Data Acquisition

#+BEGIN_SRC python :results output :session size_pca :exports none :tangle yes

import sys as SYS           # system control
import numpy as NP
SYS.path.append('toolboxes') # makes the folder where the toolbox files are located accessible to python
import EigenToolbox as ET    # coordination PCA

filename = 'data/morphometrics.pca'
mpca = ET.PrincipalComponentAnalysis.Load(filename)
print (mpca.weights[0])

#+END_SRC

#+RESULTS:
: 0.9291535954421666


Recordings were done at a local farm in Belgium during several trips in October and November 2017.
Farrowing was monitored to select Topigs x PIC piglets for another experiment citep:Ayuso2021.
Piglets from selected litters were weighed at birth and numbered with non-toxic skin markers.
Low birth weight (LBW) was classified by birth weight quantile (lowest \(10 \%\) of each litter) and by a maximum mass of \(800\)g citep:Litten2003,VanTichelen2021,Wang2016,DInca2011; all other piglets are assigned the NBW category.
At variable time points afterwards (ages \(1 - 10\) hours), piglets were briefly taken from their pen and brought to a separate room for video recording (see below).
Animals were recorded in pairs @@latex:\citep[as in][]{Mielke2018}@@, which drastically reduced anxiety and increased their motivation to cooperate.
A few animals were recorded repeatedly, usually with a changing partner.
Animals were ear-tagged and followed up: recording was repeated at approximately 4 and 10 days of age.
That data was part of the digitization procedure (i.e. "deeplabcut" network training), but excluded from further analysis (i.e. probabilistic modeling, see below).
The subject characteristics documented for analysis are birth weight (continuous, and categories "LBW"/"NBW"), mass at recording, age at recording (i.e. hours since farrowing), sex, and size.
The size of the animal was approximated by a Principal Component Analysis (PCA) of digitization landmark distances along all segments ("size PCA", only first PC used,
src_python[:session size_pca]{f"{mpca.weights[0]*100:.0f} \%"} {{{results(\(93 \%\))}}}
of variability).
Size and mass are expected to correlate, yet deviations would indicate animals of particularly slender or rotund habitus.
All procedures followed ethical regulations and guidelines, and were approved by the Ethical Committee for Animal Testing of the University of Antwerp, Belgium (ECD 2015-26).



The recording room contained an elevated runway (\(150 \times 50\)cm), covered with a rubber mat to increase friction, and visible through a transparent frontal shield.
Color videos were recorded (camera model: GC-PX100BE, JVC, Japan) at a temporal sampling rate of \(50\) frames per second and a spatial resolution of \(1920 \times 1080\) pixels (later cropped to \(500\) px height), from a distance at which the field of view would exactly capture the entire runway.
A chess board at the back wall enabled spatial calibration.
Video surveillance was permanent during the presence of the animals and stopped only in between recording sessions.
Animals were able to move freely on the enclosed platform.
To stimulate locomotion, the two animals were repeatedly placed on opposite ends of the runway.
Gentle tickling on the back and grunting vocalization of the researcher were other successful strategies to induce targeted locomotion in the direction perpendicular to the camera axis.
After recording sessions the piglets were returned to their litter and remained with the sow.
The workflow herein involved handling of the animals as a consequence of the research setting.
However, note that the procedure could easily be automated for continuous data collection by a suitable pen arrangement citep:Meijer2014,Stavrakakis2014,Netukova2021.



* Data Processing

#+BEGIN_SRC python :results output :session coordination_pca :exports none :tangle yes

import numpy as NP
import CodeM01_CoordinationPCA as cPCA

coordination_pca = cPCA.LoadCoordinationPCA()
n_features = len(coordination_pca._features)
print (n_features/8/2) # 8=fourier-order
# print (coordination_pca._features)
# print ([pc for pc in range(1,13)])
n_pcs = 12
weightsum = NP.sum(coordination_pca.weights[:n_pcs])
print (weightsum)

#+END_SRC

#+RESULTS:
: 6.0
: 0.8023993920523508


The landmark data provided by DLC was further processed for analysis.
Python code for the whole procedure is available (@@latex:\nolinkurl{https://git.sr.ht/~falk/piglet_fcas}@@, Python version 3.10.8 at time of model calculation, \nolinkurl{https://www.python.org}).
First, joint angle profiles (i.e. joint angle values over time) were extracted for all relevant joints and for the total forelimb angle (croup-withers-hoof).
Shoulder, elbow, carpal, hip, stifle, and tarsal were the six joints sufficiently well digitized and therefore considered relevant for analysis.
We then applied Fourier Series decomposition in the framework we previously termed Fourier Coefficient Affine Superimposition @@latex:\citep[FCAS,][]{Mielke2019}@@, a flexible procedure which subsumes the following steps.
Joint angle profiles are cyclic, i.e. periodical, and can therefore be transformed to the frequency domain with a Fourier Series decomposition (8 harmonics were deemed sufficient by visual comparison of raw and transformed/retransformed profiles).
In the frequency domain, the affine components (mean, amplitude, phase) of a joint angle profile are easily accessible @@latex:\citep[\textit{cf.}][]{Mielke2019}@@.
The forelimb angle served as reference to temporally align all cycles in the data set (removal of phase differences between different cycles; forelimb angle was not used further).
Then, mean and amplitude of the joint oscillations were isolated for all joint angles and are categorized as "dynamic posture" parameters.
Mean joint angle is the temporal average, whereas amplitude is related to effective range of motion (eROM).
The residual, i.e. differences captured by non-affine Fourier coefficients, can be categorized as "coordination" /sensu stricto/ (it measures the precise temporal succession of joint configurations).
In our case, there were
src_python[:session coordination_pca]{f"{n_features:.0f}"} {{{results(\(96\))}}}
variables of coordination (6 angles, 8 harmonics, real and imaginary) which were submitted to a PCA.
Only the first
src_python[:session coordination_pca]{f"{n_pcs:.0f}"} {{{results(\(12\))}}}
coordination components (\(CC\)) were used for statistical analysis, capturing
src_python[:session coordination_pca]{f"{weightsum*100:.1f} \%"} {{{results(\(80.2 \%\))}}}
of the variability in coordination.
# The number of components was chosen as a trade-off between information retention and limiting model complexity.
To summarize, FSD and FCAS served three purposes: (i) temporal alignment of the cyclic traces, (ii) separation of meaningful parameter categories (dynamic posture and coordination), and (iii) preparation for multivariate analysis via PCA.
Basic script code (Python, Matlab and R) to perform FCAS can be found on a dedicated git repository ([[https://git.sr.ht/~falk/fcas_code]]).


@@latex:\bigskip@@
Information retention is generally a strength of this method.
FCAS and PCA are mathematical transformations, which means that the information content after transformation is theoretically identical to that prior to transformation (theoretically, because only a finite number of harmonics can be used, yet this is of little concern for continuous, smooth joint angle profiles).
The neglected PCs and the residual not captured by 8 harmonics were the only information from kinematics of the given joints to be lost in this procedure, and by definition these contain the least information.
Apart from that, all information present in the raw joint angle profiles enters the analysis.
Though we used a 2D dataset herein, the procedure could be applied equally well to angles measured from 3D coordinate data citep:Scott2022.


Furthermore, all transformations are reversible, hence any analysis outcome can be translated back to kinematics with high accuracy.
Reversibility bares a lot of herein unused potential, for example for interpolating unobserved subject states or for inferring kinematics of fossile species by phylogenetic and morphometric bracketing.
Reversibility can also be of use when presenting raw joint angle profiles and their averages, as follows.
One crucial aspect of the FCAS procedure is temporal alignment of the joint angle profiles in the frequency domain.
In conventional temporal alignment, a single characteristic point in the stride cycle is chosen as a reference, wherein this is only "characteristic" for a certain part of one limb (e.g. left hindlimb hoof touchdown).
Temporal alignment to the hindhoof touchdown might cause distinct peaks in the forelimb angle joint profiles to occur at different relative points in the stride cycle (e.g. tarsal joint profiles in Fig. \ref{fig:raw_data} below, lower half, green traces).
If profiles show such variable peak positions, then their average will have a wider, less pronounced (i.e. lower amplitude), and potentially unnatural peak.
For illustration, this is analogous to averaging two sine-waves of identical amplitude, but phase shifted: in the worst case, they cancel each other out (as in "destructive interference").
The problem is not restricted to pronounced peaks, but generally occurs if the temporal intra-limb coordination varies within a data set.
Using FCAS, it is possible to get a more representative average of the raw traces which has its amplitude conserved, but phase and mean angle averaged.
This is enabled by transformation to the frequency domain, separation of affine components, removal of phase differences by shifting to average phase, profile averaging, followed by inverse transformation back to the time domain.
Because a set of profiles and phases may be calculated for each angle individually, and because phase relations can differ between joints, there are the options to align based on one reference angle (e.g. the whole forelimb, as done herein) or minimize all phase differences across all joints.
Chosing the first option herein has implications: when plotting hindlimb joints aligned by a forelimb reference (as in Fig. \ref{fig:raw_data}, lower half), phases still differ, and the "destructive interference" problem might hamper averaging.
In such cases it is possible to apply an extra, joint-wise FCAS alignment for the sole purpose of generating meaningful averages.



